posts/operator-associativity.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Associatividade de Operadores em C/C++</title>
<meta name="author" content="Lucas Vieira" />
<meta name="description" content="Programming, Tech, and occasional rant space by Lucas Vieira" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="../css/main.css" />
<link rel="stylesheet" type="text/css" href="../css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="../css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="../img/cat-i-mage.jpg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="preamble" class="status">
<nav><h1><a href="../">The Alchemist's Hideout</a></h1></nav><h1 class="title">Associatividade de Operadores em C/C++</h1><p><i>Escrito em Dec 02, 2018 por Lucas Vieira<br/><a href="mailto:lucasvieira@lisp.com.br">lucasvieira@lisp.com.br</a></i></p>
</div>
<div id="content" class="content">
<p>
Recentemente, estive sanando algumas dúvidas de colegas e amigos a respeito de
programação, mais especificamente a respeito de C/C++. Ao analisarmos alguns
exercícios simples passados por nosso professor, deparamo-nos com o seguinte
enunciado:
</p>

<blockquote>
<p>
<i>Receba três números, cada número sendo o comprimento de um lado diferente de um</i>
<i>triângulo. Verifique se a existência deste triângulo é possível e, se for,</i>
<i>imprima na tela o tipo deste triângulo. Se não for, imprima que este triângulo</i>
<i>não pode existir.</i>
</p>
</blockquote>

<p>
Associado ao exercício, tivemos uma ajuda extra de informações um pouco óbvias,
mas que aqui descrevo para que o leitor possa passar diretamente ao que
interessa, neste caso.
</p>

<ul class="org-ul">
<li>Um triângulo só existe se cada lado for menor que a soma dos outros dois;</li>
<li>Um triângulo de três lados iguais é equilátero;</li>
<li>Um triângulo de dois lados iguais é isósceles;</li>
<li>Um triângulo de lados diferentes é escaleno.</li>
</ul>

<p>
Normalmente, nas aulas não-práticas de programação, utilizamos um estilo de
pseudocódigo baseado na literatura de <i>Farrer et al.</i> Então, a primeira solução
para o exercício foi elaborada no mesmo, levando em consideração as regras
acima.
</p>

<p>
Mas, quando tratamos de C++, estamos falando de uma linguagem diferente e,
portanto, de regras sintáticas diferentes. <i>Farrer et al.</i> foi feita para ser
"interpretada" pelo cérebro; C++ foi feita para ser interpretada por um
compilador e, portanto, em certas ocasiões, é necessária uma pedância extra para
com a forma como escrevemos o algoritmo, do contrário, situações inesperadas
acontecem.
</p>

<div id="outline-container-orge6b4253" class="outline-2">
<h2 id="orge6b4253">Solução Inicial</h2>
<div class="outline-text-2" id="text-orge6b4253">
<p>
Tomemos, como exemplo, um fragmento do pseudocódigo que institui a comparação
relacionada aos três últimos pontos:
</p>

<div class="org-src-container">
<pre class="src src-fundamental">Se X = Y = Z ent&#227;o
   imprima "Tri&#226;ngulo Equil&#225;tero"
Sen&#227;o Se X = Y OU Y = Z OU Z = X ent&#227;o
   imprima "Tri&#226;ngulo Is&#243;sceles"
Sen&#227;o
   imprima "Tri&#226;ngulo Escaleno"
Fim Se
</pre>
</div>

<p>
O pseudocódigo é bem explícito, e é de fácil compreensão para um humano. Mas não
representa a forma exata como isto deveria ser escrito em C/C++,
obviamente. Ainda assim, ocorrem situações em que o programador possa ficar
confuso com esta notação, uma vez que os operadores equivalentes em C/C++ não
retém todas as propriedades dos operadores do sistema formal matemático.
</p>

<p>
Vejamos a comparação relacionada ao triângulo equilátero. Ao reescrever este
raciocínio em C++, um programador um pouco inexperiente poderia ficar tentado
a escrever:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #9d81ba;">if</span>(x == y == z) {
    <span style="color: #0D9C94;">std</span>::cout &lt;&lt; <span style="color: #f5c791;">"Triangulo Equilatero"</span> &lt;&lt; <span style="color: #0D9C94;">std</span>::endl;
}
</pre>
</div>

<p>
Esta comparação, porém, está equivocada, e não produzirá o efeito
pretendido. Mas afinal, qual o motivo para isto?
</p>
</div>
</div>

<div id="outline-container-orgf45baa9" class="outline-2">
<h2 id="orgf45baa9">Associatividade de Operadores</h2>
<div class="outline-text-2" id="text-orgf45baa9">
<p>
A Wikipedia<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> em Inglês possui um artigo sobre o tema da <i>Associatividade de
Operadores</i>. Um dos subtópicos deste artigo, relacionado a associatividade do
operador de atribuição (Em C/C++, <code>=</code>), diz que
</p>

<blockquote>
<p>
<i>For example, in C, the assignment <code>a = b</code> is an expression that returns a value</i>
<i>(namely, <code>b</code> converted to the type of <code>a</code>) with the side effect of setting <code>a</code> to this</i>
<i>value. An assignment can be performed in the middle of an expression. The</i>
<i>right-associativity of the <code>=</code> operator allows expressions such as <code>a = b = c</code> to be</i>
<i>interpreted as <code>a = (b = c)</code>, thereby setting both <code>a</code> and <code>b</code> to the value of <code>c</code>.</i>
</p>
</blockquote>

<p>
Apesar do artigo falar a respeito do operador de atribuição, um dos aspectos
dele (que pretendo aqui explorar) ocorre para todos os outros operadores em
C/C++ que possuem mais de um operando, desde que eles tenham natureza
equivalente ou sejam iguais: a ideia de uma associatividade "à direita".
</p>

<p>
Ou seja, uma situação como esta:
</p>

<div class="org-src-container">
<pre class="src src-text">A OPERADOR B OPERADOR C
</pre>
</div>

<p>
É validada, em tempo de compilação, como esta:
</p>

<div class="org-src-container">
<pre class="src src-text">A OPERADOR (B OPERADOR C)
</pre>
</div>

<p>
Quando temos operadores de similar natureza (por exemplo, operadores aritméticos
iguais, ou operadores de comparação de qualquer tipo).
</p>

<p>
Se aplicarmos esta regra ao nosso operador de igualdade (<code>==</code>), teremos que
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #454459;">// </span><span style="color: #454459;">Isto</span>
(x == y == z)

<span style="color: #454459;">// </span><span style="color: #454459;">Equivale a isto</span>
(x == (y == z))
</pre>
</div>

<p>
Mas uma operação como <code>(y == z)</code> não resulta no valor de <code>y</code> ou de <code>z</code>. Esta operação
equivale a um predicado da Lógica Proposicional, ou seja, só pode ser
interpretada como <code>true</code> ou <code>false</code>.
</p>

<p>
Em C/C++, tratamos como <code>false</code> qualquer valor que seja nulo (preferencialmente
valores inteiros), e como <code>true</code> qualquer valor que seja não-nulo (normalmente, a
constante booleana <code>true</code> equivale a <code>1</code>).
</p>

<p>
Em outras palavras: suponhamos que <code>y</code> não seja igual a <code>z</code>. Dessa forma, a operação
final que estaremos fazendo será:
</p>

<div class="org-src-container">
<pre class="src src-cpp">(x == <span style="color: #0D9C94;">false</span>)

<span style="color: #454459;">// </span><span style="color: #454459;">Que equivale a</span>
(x == <span style="color: #f5c791;">0</span>)
</pre>
</div>

<p>
O que não faz sentido algum, e está completamente fora do que pretendíamos, em
primeiro lugar!
</p>

<p>
Da mesma forma, mesmo que <code>y</code> fosse igual a <code>z</code>, estaríamos comparando se <code>x</code> é igual
a <code>true</code> e, portanto, se <code>x</code> é igual a <code>1</code>.
</p>
</div>
</div>

<div id="outline-container-orgd283898" class="outline-2">
<h2 id="orgd283898">Solução</h2>
<div class="outline-text-2" id="text-orgd283898">
<p>
A solução para este problema é quebrar esta igualdade em duas, e transformá-la
em uma relação lógica. Em C/C++, teríamos:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #9d81ba;">if</span>((x == y) &amp;&amp; (y == z)) {
    <span style="color: #0D9C94;">std</span>::cout &lt;&lt; <span style="color: #f5c791;">"Triangulo Equilatero"</span> &lt;&lt; <span style="color: #0D9C94;">std</span>::endl;
}
</pre>
</div>

<p>
O operador <code>&amp;&amp;</code> é um operador lógico que avalia dois operandos e é interpretado
como <code>true</code> se ambos os operandos forem verdadeiros. Este é o operador <code>AND</code>.
</p>

<p>
Poderemos reescrever o pseudocódigo na sintaxe de <i>Farrer et al.</i>,
utilizando C/C++, desta forma:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #9d81ba;">if</span>((x == y) &amp;&amp; (y == z)) {
    <span style="color: #0D9C94;">std</span>::cout &lt;&lt; <span style="color: #f5c791;">"Triangulo Equilatero"</span> &lt;&lt; <span style="color: #0D9C94;">std</span>::endl;
} <span style="color: #9d81ba;">else</span> <span style="color: #9d81ba;">if</span>((x == y) || (y == z) || (z == x)) {
    <span style="color: #0D9C94;">std</span>::cout &lt;&lt; <span style="color: #f5c791;">"Triangulo Isosceles"</span> &lt;&lt; <span style="color: #0D9C94;">std</span>::endl;
} <span style="color: #9d81ba;">else</span> {
    <span style="color: #0D9C94;">std</span>::cout &lt;&lt; <span style="color: #f5c791;">"Triangulo Escaleno"</span> &lt;&lt; <span style="color: #0D9C94;">std</span>::endl;
}
</pre>
</div>

<p>
Veja que, no caso da comparação para o triângulo isósceles, só nos preocupamos
em saber se, realmente, há pelo menos um lado igual ao outro. O motivo para isso
é que esta comparação só será feita se a comparação relacionada ao triângulo
equilátero for falsa e, portanto, poderemos ter certeza de que os três lados não
são iguais.
</p>

<p>
Adicionalmente, podemos ver que, como estamos procurando uma solução onde uma <b>ou</b>
outra situação ocorre, precisamos especificar o caso <code>(z == x)</code>, já que o operador
<code>OR</code> (<code>||</code>) invalida a utilidade da transitividade da igualdade que exploramos
anteriormente, da forma como a comparação foi escrita.
</p>
</div>
</div>

<div id="outline-container-org7e479f0" class="outline-2">
<h2 id="org7e479f0">Extra: O Operador Ternário</h2>
<div class="outline-text-2" id="text-org7e479f0">
<p>
Em uma nota extra, considere o operador ternário (<code>?:</code>) de C/C++. Dada a seguinte
expressão:
</p>

<div class="org-src-container">
<pre class="src src-cpp">pred1 ? conseq1 : pred2 ? conseq2 : altern;
</pre>
</div>

<p>
Podemos esclarecer o sentido desta expressão ao adicionarmos parênteses,
destacando a associatividade "à direita" da expressão:
</p>

<div class="org-src-container">
<pre class="src src-cpp">pred1 ? conseq1 : (pred2 ? conseq2 : altern);
</pre>
</div>

<p>
Como a sintaxe sugere, o segundo ternário será interpretado como alternativa ao
primeiro. Devido à regra de associatividade, C++ infere que o primeiro
agrupamento à direita que sirva como um ternário completo seja interpretado como
uma estrutura válida, e este agrupamento, então, será um valor único a ser
utilizado pelo próximo agrupamento a ser feito da direita para a esquerda, e
assim sucessivamente. Desta forma, pode-se criar facilmente uma relação do tipo
<code>if...elseif...else</code>, utilizando apenas uma cadeia de operadores ternários.
</p>
</div>

<div id="outline-container-org17f6c7b" class="outline-3">
<h3 id="org17f6c7b">O Ternário em PHP</h3>
<div class="outline-text-3" id="text-org17f6c7b">
<p>
Em uma nota relacionada, há uma intensa crítica<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> sobre o operador ternário
de PHP, em especial por ele não se comportar desta forma. Considerando a
expressão similar:
</p>

<div class="org-src-container">
<pre class="src src-php">$pred1 ? $conseq1 : $pred2 ? $conseq2 : $altern;
</pre>
</div>

<p>
Temos, no interpretador de PHP, o procedimento padrão de que esta
associatividade, exclusivamente do operador ternário, será feita da esquerda
para a direita. Em outras palavras, a expressão acima será interpretada como:
</p>

<div class="org-src-container">
<pre class="src src-php">($pred1 ? $conseq1 : $pred2) ? $conseq2 : $altern;
</pre>
</div>

<p>
Portanto, cuidado com o operador ternário em PHP. <code>:P</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org6e7632c" class="outline-2">
<h2 id="org6e7632c">Próximos passos</h2>
<div class="outline-text-2" id="text-org6e7632c">
<p>
Encerrarei por aqui minha postagem, mas esta discussão está intimamente ligada à
existência dos <code>lvalues</code> e <code>rvalues</code> em C++. Este tópico, porém, pode ser mais
extenso e, portanto, deixarei para um momento mais específico.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Notas de Rodap&eacute;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Operator_associativity#Right-associativity_of_assignment_operators">Wikipedia: Operator Associativity</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://phpsadness.com/sad/30">PHP Sadness: Ternary Operator Associativity</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<h3><a href="../">De volta à página anterior</a></h3>
</div>
</body>
</html>
